name: "cross_encoder"
backend: "python"

max_batch_size: 64

input [
  {
    name: "query"
    data_type: TYPE_STRING
    dims: [-1]
  },
  {
    name: "documents"
    data_type: TYPE_STRING
    dims: [-1, -1]
  }
]

output [
  {
    name: "scores"
    data_type: TYPE_FP32
    dims: [-1]
  }
]

instance_group [{ kind: KIND_CPU count: 1 }]
